# OpenProfileMultiSegmentSweepsNotSupported Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FormFailures..::..OpenProfileMultiSegmentSweepsNotSupported Property
BuiltInFailures..::..FormFailures Class See Also
---
An open profile cannot be swept along a multi-segment path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpenProfileMultiSegmentSweepsNotSupported { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpenProfileMultiSegmentSweepsNotSupported As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpenProfileMultiSegmentSweepsNotSupported {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FormFailures Class
Autodesk.Revit.DB Namespace